backend/app/controllers/clinics_controller.rb

SELECT "clinics".* FROM "clinics"
---
    def index
        clinics = Clinic.all

INSERT INTO "clinics" ("name", "addr", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdfdsfsd"], ["addr", "sdfsdfsdf"], ["created_at", "2021-06-27 13:39:32.033869"], ["updated_at", "2021-06-27 13:39:32.033869"]]
---
    def create
        @clinic = Clinic.new(clinic_params)
        @clinic.save

DELETE FROM "clinics" WHERE "clinics"."id" = ?  [["id", 4]]
---
    def destroy
        @clinic.destroy

SELECT "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def set_clinic
        @clinic = Clinic.find(params[:id])