backend/app/controllers/owners_controller.rb

INSERT INTO "owners" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdfdsfsd"], ["email", "sdfsdfsdf"], ["created_at", "2021-06-27 13:32:27.788455"], ["updated_at", "2021-06-27 13:32:27.788455"]]
---
    def create
        @owner = Owner.new(owner_params)
        @owner.save

SELECT "owners".* FROM "owners"
---
    def index
        owners = Owner.all

DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 1]]
---
    def destroy
        @owner.destroy

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def set_owner
        @owner = Owner.find(params[:id])