backend/app/controllers/pets_controller.rb

    def create
        @pet = Pet.new(pet_params)
        @pet.save
---
INSERT INTO "pets" ("name", "breed", "desc", "owner_id", "clinic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "CZXcsdf"], ["breed", "sfdfsd"], ["desc", "sdfsdfsd"], ["owner_id", 6], ["clinic_id", 12], ["created_at", "2021-06-27 14:38:24.252551"], ["updated_at", "2021-06-27 14:38:24.252551"]]

    def index
        pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def destroy
        @pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]